---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralConnectionHandler..::..Create Method
StructuralConnectionHandler Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IList<(Of <<'(ElementId>)>>), ElementId) | Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. |
|  | Create(Document, IList<(Of <<'(ElementId>)>>), String) | Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler. |
|  | Create(Document, IList<(Of <<'(ElementId>)>>), ElementId, IList<(Of <<'(ConnectionInputPoint>)>>)) | Creates a new instance of a Structural Connection Handler, which is defined by the elements to connect and the additional points. |

# See Also

StructuralConnectionHandler Class

StructuralConnectionHandler Members

Autodesk.Revit.DB.Structure Namespace